Repository: CofficLab/Lumi
Catalog: Plugins/AgentRAGPlugin/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hk

source: %lld Chunks
zh_hk: %lld 片段

source: %lld days ago
zh_hk: %lld天前

source: %lld Files
zh_hk: %lld 文件

source: %lld hours ago
zh_hk: %lld小時前

source: %lld Indexed
zh_hk: %lld 已索引

source: %lld minutes ago
zh_hk: %lld分鐘前

# ^[%lld Chunk](inflect: true)
source: %lld Chunk
zh_hk: %lld 片段

# ^[%lld day](inflect: true) ago
source: %lld day ago
zh_hk: %lld天前

# ^[%lld File](inflect: true)
source: %lld File
zh_hk: %lld 文件

# ^[%lld hour](inflect: true) ago
source: %lld hour ago
zh_hk: %lld小時前

# ^[%lld Indexed](inflect: true)
source: %lld Indexed
zh_hk: %lld 已索引

# ^[%lld minute](inflect: true) ago
source: %lld minute ago
zh_hk: %lld分鐘前

source: About RAG
zh_hk: 關於 RAG

source: All project indexes updated.
zh_hk: 全部项目索引更新完成。

source: Checking index status...
zh_hk: 檢查索引狀態...

source: Enable RAG
zh_hk: 啟用 RAG

source: Failed to get status
zh_hk: 獲取狀態失敗

source: Failed to load index status: %@
zh_hk: 读取索引状态失败：%@

source: Failed to rebuild indexes: %@
zh_hk: 重建索引失败：%@

source: Index update completed: %@
zh_hk: 索引更新完成：%@

source: Indexing...
zh_hk: RAG 索引中...

source: Just now
zh_hk: 剛剛

source: No project selected
zh_hk: 未選擇項目

source: Not initialized
zh_hk: 未初始化

source: Progress: %lld/%lld
zh_hk: 进度：%lld/%lld

source: RAG (Retrieval-Augmented Generation) is a technology that enables AI to access project code. Workflow: 1. Index project files 2. Search for relevant code when user asks questions 3. AI answers based on the found code This allows AI to accurately answer questions about your project.
zh_hk: RAG (Retrieval-Augmented Generation) 是一種讓 AI 能夠查閱項目代碼的技術。 工作流程: 1. 索引項目文件 2. 用戶提問時搜索相關代碼 3. AI 基於找到的代碼回答問題 這樣 AI 就能準確回答關於你項目的問題了。

source: RAG 服务将在插件启用时自动初始化
zh_hk: RAG 服務將在插件啟用時自動初始化

source: RAG 索引状态
zh_hk: RAG 索引狀態

source: Ready
zh_hk: 已就緒

source: Rebuild failed: %@
zh_hk: 重建失败：%@

source: Rebuilding all indexes...
zh_hk: 正在重建全部索引...

source: Rebuilt: %@
zh_hk: 已重建：%@

source: Refresh failed: %@
zh_hk: 刷新失败：%@

source: Refreshed: %@
zh_hk: 已刷新：%@

source: Retrieval-Augmented Generation
zh_hk: 檢索增強生成

# Retrieval-Augmented Generation Description
source: When enabled, AI can answer questions based on project code
zh_hk: 啟用後，AI 可以基於項目代碼回答問題

source: Status
zh_hk: 狀態

source: System Information
zh_hk: 系統信息

source: Vector Backend: %@
zh_hk: 向量后端：%@

source: Vector Database
zh_hk: 向量數據庫

source: Vector Model
zh_hk: 向量模型

source: 个
zh_hk: 個

source: 最后索引
zh_hk: 最後索引

source: 分钟前
zh_hk: 分鐘前

source: 刚刚
zh_hk: 剛剛

source: 刷新
zh_hk: 重新整理

source: 刷新全部
zh_hk: 重新整理全部

source: 刷新全部状态
zh_hk: 重新整理全部狀態

source: 向量后端：%@
zh_hk: 向量後端：%@

source: 向量维度
zh_hk: 向量維度

source: 小时前
zh_hk: 小時前

source: 已扫描
zh_hk: 已掃描

source: 已跳过
zh_hk: 已跳過

source: 已过期
zh_hk: 已過期

source: 当前文件
zh_hk: 當前檔案

source: 文件
zh_hk: 檔案

source: 文件数
zh_hk: 檔案數

source: 文件数量
zh_hk: 檔案數量

source: 文档块
zh_hk: 文檔塊

source: 文档块数量
zh_hk: 文檔塊數量

source: 暂无项目
zh_hk: 暫無項目

source: 正在检查索引状态...
zh_hk: 正在檢查索引狀態...

source: 片段数
zh_hk: 片段數

source: 状态
zh_hk: 狀態

source: 索引已过期，建议重新索引
zh_hk: 索引已過期，建議重新索引

source: 获取索引状态失败
zh_hk: 獲取索引狀態失敗

source: 请先选择或添加项目，RAG 才能建立与展示索引。
zh_hk: 請先選擇或添加項目，RAG 才能建立與展示索引。

source: 读取中…
zh_hk: 讀取中…

source: 运行时
zh_hk: 運行時

source: 进度：%lld/%lld
zh_hk: 進度：%lld/%lld
